---
kind: method
id: M:Autodesk.Revit.DB.PolymeshFacet.GetVertices
source: html/e99110ba-27af-b41b-0e9c-f0dd29ccd938.htm
---
# Autodesk.Revit.DB.PolymeshFacet.GetVertices Method

Returns the three vertices that define this facet

## Syntax (C#)
```csharp
public IList<int> GetVertices()
```

## Remarks
A container with three integers (indices of the vertices) is returned.